# running in test1_amlib_timers_cover/src/
read_ilang test1_amlib_timers_toplevel.il
prep -top top

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
