# running in test6_formal_verification_timer_tryToTest_timerTest/src/
read_ilang top.il
prep


memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
